-- 사원 릴레이션
DROP TABLE 사원;

CREATE TABLE 사원 (
	사원번호 INT PRIMARY KEY,
	이름 VARCHAR) NOT NULL,
	입사일 DATE NOT NULL,
	호봉 INT NOT NULL DEFALUT,
	휴대폰 VARCHAR(13) UNIQUE
);

INSERT INTO 사원 VALUES
 (1101, '김정은', '2027-03-01', 2, '01005232009'),
 (1102, '김정아', '2024-05-22', 5, '01045415484'),
 (1103, '김미래', '2015-02-01', 6, '01094892548'),
 (1201, '이하늘', '2026-11-21', 4, '010218485955'),
 (1202, '고다니엘', '2025-09-05', 2, '01068484655'),
 (1301, '정석호', '2023-03-18', 2, '010548549565'),
 (1302, '김은찬', '2027-07-12', 3, '010325697984'),
 (1401, '강민석', '2020-11-01', 9, '010546458965'),
 (1402, '이정숙', '2020-11-01', DEFALUT, '010546458965');

SELECT * FROM 사원;

-- 부서 릴레이션
CREATE TABLE 부서 (
	부서번호 INT PRIMARY KEY,
	부서명 VARCHAR(10) UNIQUE DEFALUT,
	부서장 INT UNIQUE,
	사무실 VARCHAR(4) NOT NULL,
	전화번호 VARCHAR(11) UNIQUE
);

INSERT INTO 부서 VALUES
 (100, '기획실', 1101, 'A402', '02-244-1256'),
 (200, '비서실', 1102, 'A501', '02-355-3564'),
 (300, '총무부', 1201, 'B311', '02-256-2575'),
 (400, DEFAULT, 1203, 'B201', '02-252-1346'),
 (500, '자재부', NULL, 'A101', '02-651-2624');

-- 근무하다 릴레이션
CREATE TABLE 근무하다 (
	사번 INT REFERENCES 사원(사번),
	부서번호 INT REFERENCES 부서(부서번호),
	직책 VARCHAR(10) NOT NULL
);

INSERT INTO 근무하다 VALUES 
 (1101, 100, '부장'),
 (1102, 200, '과장'),
 (1103, 300, '대리'),
 (1104, 400, '부장'),
 (1105, 500, '대리'),
 (1106, 100, '과장'),
 (1107, 100, '사원'),
 (1108, 400, '사원');

SELECT * FROM 근무하다
WHERE 직책 = '사원';
